In [1]:
import pandas as pd
import numpy as np

In [2]:
A = ['a','b','c','d']
B = ['e',np.nan,'g','h']
C = ['i','j','k',np.nan]
D = ['l','m','n','o']
E = ['p','q','r','s']
df = pd.DataFrame([A,B,C,D,E], columns=['one','two','three','four'])
df

  one  two three four
0   a    b     c    d
1   e  NaN     g    h
2   i    j     k  NaN
3   l    m     n    o
4   p    q     r    s

In [ ]:
# sandeshsuman100@gmail.com

## fillna()

In [4]:
df.fillna(2, inplace=True)
df

  one two three four
0   a   b     c    d
1   e   2     g    h
2   i   j     k    2
3   l   m     n    o
4   p   q     r    s

## Dropna()

In [5]:
#axix = 0 means row wise and axis = 1 means column wise
A = ['a','b','c','d']
B = ['e',np.nan,'g','h']
C = ['i','j','k',np.nan]
D = ['l','m','n','o']
E = ['p','q','r','s']
df = pd.DataFrame([A,B,C,D,E], columns=['one','two','three','four'])
df

  one  two three four
0   a    b     c    d
1   e  NaN     g    h
2   i    j     k  NaN
3   l    m     n    o
4   p    q     r    s

In [7]:
df.dropna(axis=0, inplace=True)
df

  one two three four
0   a   b     c    d
3   l   m     n    o
4   p   q     r    s

In [8]:
dic = {"A":[1,2,3,4,5], "B":[6,7,8,9,10], "C":[11,12,13,14,15]}
df = pd.DataFrame(dic)
df

   A   B   C
0  1   6  11
1  2   7  12
2  3   8  13
3  4   9  14
4  5  10  15

In [13]:
df.apply(lambda x: x*2)

    A   B   C
0   2  12  22
1   4  14  24
2   6  16  26
3   8  18  28
4  10  20  30

In [14]:
df.apply(sum, axis=0)

A    15
B    40
C    65
dtype: int64

In [17]:
df.apply(np.mean, axis=0)

A     3.0
B     8.0
C    13.0
dtype: float64

## Group by
The `groupby()` method in pandas is used to split the data into groups based on some criteria. It is used to group data by one or more columns and perform some aggregate functions on the grouped data. This is particularly useful for summarizing data and gaining insights from large datasets.

In [18]:
import numpy as np
dic = {
    'Name': ['Bob','Sam','Mary','Alice','Beth'],
    'Status': ['Current','Alumni','Alumni','Alumni','Current'],
    'Fees': ['Due', 'Clear', 'Scholarship', 'Scholarship', 'Due'],
    'Score': [78,68,89,87,76],
    'Score2': [67,87,96,95,np.nan]
}
import pandas as pd
df = pd.DataFrame(dic)
df

# Categorical Data: Certain sets of unique values

    Name   Status         Fees  Score  Score2
0    Bob  Current          Due     78    67.0
1    Sam   Alumni        Clear     68    87.0
2   Mary   Alumni  Scholarship     89    96.0
3  Alice   Alumni  Scholarship     87    95.0
4   Beth  Current          Due     76     NaN

In [19]:
status = df.groupby('Status')

In [20]:
status.groups

{'Alumni': [1, 2, 3], 'Current': [0, 4]}


This function uses the iloc method to select data from a DataFrame by index positions.
The iloc method allows for integer-location based indexing for selection by position.

In [25]:
# Select the first row
first_row = df.iloc[0]
print("First row:\n", first_row)

# Select the first three rows
first_three_rows = df.iloc[:3]
print("\nFirst three rows:\n", first_three_rows)

# Select the second and third columns of the first three rows
subset = df.iloc[:3, 1:3]
print("\nSubset of first three rows and second and third columns:\n", subset)

# Select the last row
last_row = df.iloc[-1]
print("\nLast row:\n", last_row)

First row:
 Name          Bob
Status    Current
Fees          Due
Score          78
Score2       67.0
Name: 0, dtype: object

First three rows:
    Name   Status         Fees  Score  Score2
0   Bob  Current          Due     78    67.0
1   Sam   Alumni        Clear     68    87.0
2  Mary   Alumni  Scholarship     89    96.0

Subset of first three rows and second and third columns:
     Status         Fees
0  Current          Due
1   Alumni        Clear
2   Alumni  Scholarship

Last row:
 Name         Beth
Status    Current
Fees          Due
Score          76
Score2        NaN
Name: 4, dtype: object

In [23]:
fees = df.groupby('Fees')
fees.groups

{'Clear': [1], 'Due': [0, 4], 'Scholarship': [2, 3]}

In [24]:

for fee_status, students in fees.groups.items():
  if fee_status=="Scholarship":
    for student in students:
      print(df.iloc[student])

Name             Mary
Status         Alumni
Fees      Scholarship
Score              89
Score2           96.0
Name: 2, dtype: object
Name            Alice
Status         Alumni
Fees      Scholarship
Score              87
Score2           95.0
Name: 3, dtype: object